Tekla Open API Reference for Tekla Structures 2025
Material Class
 The Material class represents a single material that parts can be made of.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Material
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Material
<SerializableAttribute>
Public NotInheritable Class Material
The Material type exposes the following members.
Constructors
Name | Description
Material
 Instantiates an empty material instance.
Top
Properties
Name | Description
MaterialString
 Identifies the material in a string format.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Beam beam = new Beam(new Point(5000, 7000, 0), new Point(6000, 7000, 0));
           beam.Material.MaterialString = "K40-1";
           beam.Profile.ProfileString = "250*250";
           beam.Finish = "PAINT";
           bool result = false;
           result = beam.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace